# SizeNotAvailableInFabricationService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..SizeNotAvailableInFabricationService Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
Sizes:%1!s! in system %2!s! are not available in fabrication service:%3!s!, All available sizes are:\n%4!s!.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SizeNotAvailableInFabricationService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SizeNotAvailableInFabricationService As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SizeNotAvailableInFabricationService {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace